Revit 2027 API
ExternalResourceBrowserData.AddResource Method
Overload List
Name | Description
AddResource(String) |  Adds an external resource to the folder path by supplying the resource name.
AddResource(String, IDictionary<String, String>) |  Adds an external resource to the folder path by supplying the resource name and reference information.
AddResource(String, String) |  Adds an external resource to the folder path by supplying the resource name and version.
AddResource(String, String, IDictionary<String, String>) |  Adds an external resource to the folder path by supplying the resource name, version and reference information.
Top
See Also
Reference
ExternalResourceBrowserData Class
Autodesk.Revit.DB Namespace